# 数据合并及分组

## 1. 数据合并

In [1]:
import datetime

In [6]:

weeks= 3500/40.0
weeks

87.5

In [8]:
import datetime
u = datetime.datetime.strptime("2022-04-03","%Y-%m-%d")
weeks = 2345.0/40.0
d = datetime.timedelta(weeks=88)
t = u + d
print(t)

2023-12-10 00:00:00

In [2]:
import pandas as pd

staff_df = pd.DataFrame([{'姓名': '张三', '部门': '研发部'},
                        {'姓名': '李四', '部门': '财务部'},
                        {'姓名': '赵六', '部门': '市场部'}])


student_df = pd.DataFrame([{'姓名': '张三', '专业': '计算机'},
                        {'姓名': '李四', '专业': '会计'},
                        {'姓名': '王五', '专业': '市场营销'}])

print(staff_df)
print(student_df)

   姓名   部门
0  张三  研发部
1  李四  财务部
2  赵六  市场部
   姓名    专业
0  张三   计算机
1  李四    会计
2  王五  市场营销

In [3]:
pd.merge(staff_df, student_df, how='outer', on='姓名')
# 或者
# staff_df.merge(student_df, how='outer', on='姓名')

   姓名   部门    专业
0  张三  研发部   计算机
1  李四  财务部    会计
2  赵六  市场部   NaN
3  王五  NaN  市场营销

In [4]:
pd.merge(staff_df, student_df, how='inner', on='姓名')
# 或者
# staff_df.merge(student_df, how='inner', on='姓名')

   姓名   部门   专业
0  张三  研发部  计算机
1  李四  财务部   会计

In [5]:
pd.merge(staff_df, student_df, how='left', on='姓名')
# 或者
# staff_df.merge(student_df, how='left', on='姓名')

   姓名   部门   专业
0  张三  研发部  计算机
1  李四  财务部   会计
2  赵六  市场部  NaN

In [6]:
pd.merge(staff_df, student_df, how='right', on='姓名')
# 或者
# staff_df.merge(student_df, how='right', on='姓名')

   姓名   部门    专业
0  张三  研发部   计算机
1  李四  财务部    会计
2  王五  NaN  市场营销

In [7]:
# 也可以按索引进行合并
staff_df.set_index('姓名', inplace=True)
student_df.set_index('姓名', inplace=True)
print(staff_df)
print(student_df)

     部门
姓名
张三  研发部
李四  财务部
赵六  市场部
      专业
姓名
张三   计算机
李四    会计
王五  市场营销

In [8]:
pd.merge(staff_df, student_df, how='left', left_index=True, right_index=True)
# 或者
# staff_df.merge(student_df, how='left', left_index=True, right_index=True)

     部门   专业
姓名
张三  研发部  计算机
李四  财务部   会计
赵六  市场部  NaN

In [9]:
# 当数据中的列名不同时，使用left_on，right_on
staff_df.reset_index(inplace=True)
student_df.reset_index(inplace=True)
print(staff_df)
print(student_df)

   姓名   部门
0  张三  研发部
1  李四  财务部
2  赵六  市场部
   姓名    专业
0  张三   计算机
1  李四    会计
2  王五  市场营销

In [10]:
staff_df.rename(columns={'姓名': '员工姓名'}, inplace=True)
student_df.rename(columns={'姓名': '学生姓名'}, inplace=True)
print(staff_df)
print(student_df)

  员工姓名   部门
0   张三  研发部
1   李四  财务部
2   赵六  市场部
  学生姓名    专业
0   张三   计算机
1   李四    会计
2   王五  市场营销

In [11]:
pd.merge(staff_df, student_df, how='left', left_on='员工姓名', right_on='学生姓名')

  员工姓名   部门 学生姓名   专业
0   张三  研发部   张三  计算机
1   李四  财务部   李四   会计
2   赵六  市场部  NaN  NaN

In [12]:
# 如果两个数据中包含有相同的列名（不是要合并的列）时，merge会自动加后缀作为区别
staff_df['地址'] = ['天津', '北京', '上海']
student_df['地址'] = ['天津', '上海', '广州']
print(staff_df)
print(student_df)

  员工姓名   部门  地址
0   张三  研发部  天津
1   李四  财务部  北京
2   赵六  市场部  上海
  学生姓名    专业  地址
0   张三   计算机  天津
1   李四    会计  上海
2   王五  市场营销  广州

In [13]:
pd.merge(staff_df, student_df, how='left', left_on='员工姓名', right_on='学生姓名')

  员工姓名   部门 地址_x 学生姓名   专业 地址_y
0   张三  研发部   天津   张三  计算机   天津
1   李四  财务部   北京   李四   会计   上海
2   赵六  市场部   上海  NaN  NaN  NaN

In [14]:
# 也可指定后缀名称
pd.merge(staff_df, student_df, how='left', left_on='员工姓名', right_on='学生姓名', suffixes=('(公司)', '(家乡)'))

  员工姓名   部门 地址(公司) 学生姓名   专业 地址(家乡)
0   张三  研发部     天津   张三  计算机     天津
1   李四  财务部     北京   李四   会计     上海
2   赵六  市场部     上海  NaN  NaN    NaN

In [15]:
# 也可以指定多列进行合并，找出同一个人的工作地址和家乡地址相同的记录
pd.merge(staff_df, student_df, how='inner', left_on=['员工姓名', '地址'], right_on=['学生姓名', '地址'])

  员工姓名   部门  地址 学生姓名   专业
0   张三  研发部  天津   张三  计算机

In [16]:
# apply使用
# 获取姓
staff_df['员工姓名'].apply(lambda x: x[0])

0    张
1    李
2    赵
Name: 员工姓名, dtype: object

In [17]:
# 获取名
staff_df['员工姓名'].apply(lambda x: x[1:])

0    三
1    四
2    六
Name: 员工姓名, dtype: object

In [18]:
# 结果合并
staff_df.loc[:, '姓'] = staff_df['员工姓名'].apply(lambda x: x[0])
staff_df.loc[:, '名'] = staff_df['员工姓名'].apply(lambda x: x[1:])
print(staff_df)

  员工姓名   部门  地址  姓  名
0   张三  研发部  天津  张  三
1   李四  财务部  北京  李  四
2   赵六  市场部  上海  赵  六

## 2. 数据分组

In [3]:
import pandas as pd

In [4]:
report_data = pd.read_csv('./国际音标.csv')
report_data.head()

   0001  太阳  ～下山了     ha31no44  Unnamed: 4 Unnamed: 5
0   2.0  月亮  ～出来了    kun22la44         NaN        NaN
1   3.0  星星   NaN  l̥in44tei35         NaN        NaN
2   4.0   云   NaN        hau44         NaN        NaN
3   5.0   风   NaN        kji35         NaN        NaN
4   6.0  台风   NaN          （无）         NaN        NaN

In [ ]:
report_data = report_data

In [14]:
report_data['label'] = report_data.apply(lambda row: row['Amount'] == "Yes", axis=1)

In [21]:
report_data['Amounts'] = report_data.apply(lambda row: row['Amount'][1:], axis=1)

In [22]:
report_data['Amounts'] = report_data['Amounts'].astype(float)

In [23]:
report_data.head()

,Date,Description,Amount,Type,label,Amounts
0,"Oct 28, 2019",VIDEOTRON LTEE. 110 PPACCMONTREAL QC,$133.79,Telcome,False,133.79
1,"Oct 24, 2019",DUTY FREE MTL INT'L ST-LAURENT QC,$43.00,One-time,False,43.00
2,"Oct 19, 2019",PAYPAL *GOOGLE LONG TE 4029357733 NS,$30.99,Game,False,30.99
3,"Oct 14, 2019",PAYPAL *GOOGLE LONG TE 4029357733 NS,$24.99,Game,False,24.99
4,"Oct 14, 2019",PAYPAL *GOOGLE LONG TE 4029357733 NS,$30.99,Game,False,30.99

In [24]:
grouped = report_data.groupby('Type')

In [25]:
grouped['Amounts'].sum()

Type
Game         161.11
Meet          14.79
One-time      43.00
Social        14.09
Telcome      492.15
Transport    141.00
Travel        23.00
Name: Amounts, dtype: float64

In [19]:
report_data = pd.read_csv('./2015.csv')
report_data.head()

,Country,Region,Happiness Rank,Happiness Score,Standard Error,Economy (GDP per Capita),Family,Health (Life Expectancy),Freedom,Trust (Government Corruption),Generosity,Dystopia Residual
0,Switzerland,Western Europe,1,7.587,0.03411,1.39651,1.34951,0.94143,0.66557,0.41978,0.29678,2.51738
1,Iceland,Western Europe,2,7.561,0.04884,1.30232,1.40223,0.94784,0.62877,0.14145,0.43630,2.70201
2,Denmark,Western Europe,3,7.527,0.03328,1.32548,1.36058,0.87464,0.64938,0.48357,0.34139,2.49204
3,Norway,Western Europe,4,7.522,0.03880,1.45900,1.33095,0.88521,0.66973,0.36503,0.34699,2.46531
4,Canada,North America,5,7.427,0.03553,1.32629,1.32261,0.90563,0.63297,0.32957,0.45811,2.45176

In [20]:
#groupby()
grouped = report_data.groupby('Region')

In [21]:
grouped['Happiness Score'].mean()

Region
Australia and New Zealand          7.285000
Central and Eastern Europe         5.332931
Eastern Asia                       5.626167
Latin America and Caribbean        6.144682
Middle East and Northern Africa    5.406900
North America                      7.273000
Southeastern Asia                  5.317444
Southern Asia                      4.580857
Sub-Saharan Africa                 4.202800
Western Europe                     6.689619
Name: Happiness Score, dtype: float64

In [22]:
size_by_group = grouped.size()
size_by_group

Region
Australia and New Zealand           2
Central and Eastern Europe         29
Eastern Asia                        6
Latin America and Caribbean        22
Middle East and Northern Africa    20
North America                       2
Southeastern Asia                   9
Southern Asia                       7
Sub-Saharan Africa                 40
Western Europe                     21
dtype: int64

In [ ]:
type(size_by_group)

In [ ]:
size_by_group_sort = size_by_group.sort_values(ascending=False).reset_index().reset_index()
size_by_group_sort['count'] = size_by_group_sort[0]
size_by_group_sort

In [ ]:
size_by_group_sort.reset_index()
size_by_group_sort.index

In [ ]:
size_by_group_sort.reset_index().reset_index()
size_by_group_sort.index

In [ ]:
size_by_group_sort = size_by_group.sort_index

In [ ]:
size_by_group_sort = size_by_group.sort_index

In [ ]:
# 迭代groupby对象
for group, frame in grouped: 
    mean_score = frame['Happiness Score'].mean()
    max_score = frame['Happiness Score'].max()
    min_score = frame['Happiness Score'].min()
    print('{}地区的平均幸福指数：{}，最高幸福指数：{}，最低幸福指数{}'.format(group, mean_score, max_score, min_score))

In [ ]:
# 自定义函数进行分组
# 按照幸福指数排名进行划分，1-10, 10-20, >20
# 如果自定义函数，操作针对的是index
report_data2 = report_data.set_index('Happiness Rank')

def get_rank_group(rank):
    rank_group = ''
    if rank <= 10:
        rank_group = '0 -- 10'
    elif rank <= 20:
        rank_group = '10 -- 20'
    else:
        rank_group = '> 20'
    return rank_group

grouped = report_data2.groupby(get_rank_group)
for group, frame in grouped:
    print('{}分组的数据个数：{}'.format(group, len(frame)))

grouped.size()

In [ ]:
# 实际项目中，通常可以先人为构造出一个分组列，然后再进行groupby

# 按照score的整数部分进行分组
# 按照幸福指数排名进行划分，1-10, 10-20, >20
# 如果自定义函数，操作针对的是index
report_data['score group'] = report_data['Happiness Score'].apply(lambda score: int(score))

grouped = report_data.groupby('score group')
for group, frame in grouped:
    print('幸福指数整数部分为{}的分组数据个数：{}'.format(group, len(frame)))

grouped.size()

In [ ]:
import numpy as np

grouped.agg({'Happiness Score': np.mean, 'Happiness Rank': np.max})

In [ ]:
grouped['Happiness Score'].agg(func)